#+title: Terraform

** Basic terraform commands
- terraform init
- terraform validate
- terraform plan
- terraform apply
- terraform destroy

** main.tf
#+begin_src terraform
terraform {

          required_providers {:
          aws = {
              source = "hashicorp/aws"
              }
        }

}

provider "aws" {
         region = "us-east-1"
         access_key = "IAM-user-key"
         secret_key = "supersecretkey"
}

resource "aws_instance" my-ec2-instance {
         ami = "copyami-id-from-console"
         instance_type = "t2.micro"

         tags = {
              Name = "rohit-ec2"
              }
}
#+end_src

#+begin_src emacs-lisp :tangle yes
(+ 2 4 5)
#+end_src

#+RESULTS:
: 11

#+begin_src bash :tangle yes
a=2
b=4
echo $(($a+$b))
#+end_src

#+RESULTS:
: 6
*** DONE [#A] do something
CLOSED: [2024-03-11 Mon 16:41]
*** DONE [#B] update website
CLOSED: [2024-03-11 Mon 11:53]
